In [2]:
import pandas as pd

In [8]:
import numpy as np

conos = pd.DataFrame({
    'Sabor': np.array(['mora', 'vainilla','chocolate', 'mora', 'chocolate']),
    'Precio': np.array([3500, 4700, 6500, 5200, 5700 ])
})

In [9]:
conos['Precio']

0    3500
1    4700
2    6500
3    5200
4    5700
Name: Precio, dtype: int64

In [10]:
conos[['Sabor', 'Precio']]

       Sabor  Precio
0       mora    3500
1   vainilla    4700
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [15]:
conos[: :-1]

       Sabor  Precio
4  chocolate    5700
3       mora    5200
2  chocolate    6500
1   vainilla    4700
0       mora    3500

In [18]:
conos[1:3]

       Sabor  Precio
1   vainilla    4700
2  chocolate    6500

In [20]:
conos.sort_values(by='Sabor', ascending=False)

       Sabor  Precio
1   vainilla    4700
0       mora    3500
3       mora    5200
2  chocolate    6500
4  chocolate    5700

In [21]:
conos.head(2)

      Sabor  Precio
0      mora    3500
1  vainilla    4700

In [22]:
conos.tail(1)

       Sabor  Precio
4  chocolate    5700

In [26]:
conos.sample(1)

  Sabor  Precio
3  mora    5200

In [27]:
conos.describe()

            Precio
count     5.000000
mean   5120.000000
std    1123.387734
min    3500.000000
25%    4700.000000
50%    5200.000000
75%    5700.000000
max    6500.000000

In [28]:
conos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sabor   5 non-null      object
 1   Precio  5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes